app/controllers/courses_controller.rb

INSERT INTO "courses" ("name", "course_type", "teaching_type", "exam_type", "credit", "limit_num", "class_room", "course_time", "course_week", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @course = Course.new(course_params)
    if @course.save

SELECT "courses".* FROM "courses"
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 236]]
---
  def list
    @opened=Array.new
    @course=Course.all
    @course=@course-current_user.courses
    @course.each do |course|

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
---
  def select
    @course=Course.find_by_id(params[:id])

SELECT  "courses".* FROM "courses" WHERE (1) LIMIT 1
---
  def quit
    @course=Course.find_by(params[:id])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "courses" SET "open" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["open", "t"], ["updated_at", "2016-11-26 15:14:35.053068"], ["id", 1]]
---
def open
   @course=Course.find_by_id(params[:id])
    @course.update_attribute(:open, true)

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 35]]
UPDATE "courses" SET "open" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["open", "f"], ["updated_at", "2016-11-26 15:26:40.276289"], ["id", 35]]
---
def close
    @course=Course.find_by_id(params[:id])
    @course.update_attribute(:open, false)